
#include "RN8302B.h"
#include "main.h"




typedef unsigned char  		u8;
typedef signed char  		s8;
typedef unsigned short  	u16;
typedef signed short  		s16;
typedef unsigned long int  	u32;
typedef signed long int  	s32;
typedef unsigned short      WORD;
typedef	unsigned char	    BOOL;
#define DL645_MAX_FL   5U
#define MAX_COMPACK_SIZE 5U
#define NOP()            __NOP()
#if 1
#define PinWrite_ADSCLK(x)  	( (x) ? (HAL_GPIO_WritePin(GPIOA, SPI1_CLK_PIN, GPIO_PIN_SET)) : (HAL_GPIO_WritePin(GPIOA, SPI1_CLK_PIN, GPIO_PIN_RESET)) )	//
#define PinRead_ADSDI()			  (HAL_GPIO_ReadPin(GPIOA,SPI1_MISO_PIN))
#define PinWrite_ADSDO(x)  		( (x) ? (HAL_GPIO_WritePin(GPIOA, SPI1_MOSI_PIN, GPIO_PIN_SET)) : (HAL_GPIO_WritePin(GPIOA, SPI1_MOSI_PIN, GPIO_PIN_RESET)) )	//	
#define PinWrite_ADCS(x)  	( (x) ? (HAL_GPIO_WritePin(GPIOA, SPI1_CS_PIN, GPIO_PIN_SET)) : (HAL_GPIO_WritePin(GPIOA, SPI1_CS_PIN, GPIO_PIN_RESET)) )
#else
#define PinWrite_ADSCLK(x)  	( (x) ? (HAL_GPIO_WritePin(GPIOB, SPI1_CLK_PIN, GPIO_PIN_SET)) : (HAL_GPIO_WritePin(GPIOB, SPI1_CLK_PIN, GPIO_PIN_RESET)) )	//
#define PinRead_ADSDI()			  (HAL_GPIO_ReadPin(GPIOB,SPI1_MISO_PIN))
#define PinWrite_ADSDO(x)  		( (x) ? (HAL_GPIO_WritePin(GPIOB, SPI1_MOSI_PIN, GPIO_PIN_SET)) : (HAL_GPIO_WritePin(GPIOB, SPI1_MOSI_PIN, GPIO_PIN_RESET)) )	//	
#define PinWrite_ADCS(x)  	( (x) ? (HAL_GPIO_WritePin(GPIOB, SPI1_CS_PIN, GPIO_PIN_SET)) : (HAL_GPIO_WritePin(GPIOB, SPI1_CS_PIN, GPIO_PIN_RESET)) )

#endif

void Delay1us(void)
{
 for(int i=0;i<3;i++)
	__NOP();

}
void Delay_ms(unsigned int ms)
{
  for(unsigned int i=0;i<1000*ms;i++){
	  Delay1us();
  }
}
void Delay5ms(int ms)
{
  for(unsigned int i=0;i<1000*5*ms;i++){
	  Delay1us();
  }
}



typedef struct {
//	u32 Dat : 23;
//	u32 S : 1;
	u8 Dat0;
	u8 Dat1;
	u8 Dat2 : 7;
	u8 S : 1;			
} sDF09;
typedef struct {
	u32 Dat;
} sDF11;
typedef	sDF11 sFsEgSh_TypeDef;	

 u16	SysStamp;

u16 fnStamp_Through(u16 Ago)
{	
	if (SysStamp >= Ago)
		{return (SysStamp - Ago);}
	else
		{return ( (0xffff - Ago) + SysStamp);}
}

u16 fnHexToBcd_u16(u16 Dat)
{
	u16 Result = 0;

	Dat = Dat % 10000;
	Result += (Dat / 1000) * 0x1000;
	Dat = Dat % 1000;	
	Result += (Dat / 100) * 0x100;
	Dat = Dat % 100;	
	Result += (Dat / 10) * 0x10;
	Dat = Dat % 10;	
	Result += Dat;
		
	return(Result);	
}
u32	fnHexToBcd_u32(u32 Dat)
{	
	u32 result = 0;
	
	Dat = Dat % 100000000;
	result += (Dat / 10000000) * 0x10000000;
	Dat = Dat % 10000000;	
	result += (Dat / 1000000) * 0x1000000;
	Dat = Dat % 1000000;
	result += (Dat / 100000) * 0x100000;
	Dat = Dat % 100000;
	result += (Dat / 10000) * 0x10000;
	Dat = Dat % 10000;	
	result += (Dat / 1000) * 0x1000;
	Dat = Dat % 1000;
	result += (Dat / 100) * 0x100;
	Dat = Dat % 100;
	result += (Dat / 10) * 0x10;
	Dat = Dat % 10;	
	result += Dat;
	
	return(result);
}

u16 fnDFConver_Bcd16To16(s16 Dat)
{
	u16 Result;
	Result = abs(Dat) % 8000;			
	Result = fnHexToBcd_u16(Result);
        if(Dat < 0 ) Result |= 0x8000;
	else Result &= 0x7fff;	
	return(Result);
}
u32 fnDFConver_Bcd32To32(s32 Dat)
{
	u32 Result;
	Result = labs(Dat) % 80000000;			
	Result = fnHexToBcd_u32(Result);
        if(Dat < 0 ) Result |= 0x80000000;
	else Result &= 0x7fffffff;	
	return(Result);
}

sDF09 fnDFConver_Hex32ToDF09(s32 Dat)
{	
	sDF09	Result;	
	memset(&Result , 0 , sizeof(sDF09) );
	if(Dat < 0) Result.S = 1;
	else Result.S = 0;	        
	Dat = labs(Dat) % 800000;
	Dat = fnHexToBcd_u32(Dat);
	Result.Dat0 = Dat;
	Result.Dat1 = Dat >> 8;
	Result.Dat2 = Dat >> 16;
	return(Result);	
}

typedef union                                         //公共数据运算区8字节
{
	u8  ucTempBuf[8];
	u32 lTemp32;
	u16 wTemp16;
	u8  ucTemp8;
}sDl645StruDataComm_TypeDef;

  typedef struct
  {
	  u8	  ChkErrCnt;	   //读错误计数1
	  
	  s32	  Pw[12];		  //{Pa Pb Pc P Qa Qb Qc Q Sa Sb Sc S}	 48 
	  s32	  UI[7];		  //Ua Ub Uc Ia Ib Ic Inal	 28 
	  s32	  VectorU[9];	  // 正序、负序、零序电压
	  s32	  VectorI[9];	  // 正序、负序、零序电流
	  s32	  Pf[4];		  //Pf Pfa Pfb Pfc		16	   
	  u32	  Frequency;	  //电网频率，单位：		4  
	  s32	  YUI[3],YUU[2];  //20
								  
	  s32	  Pulse[15];	  //前台高频脉冲48
	  //---电能脉冲---	  
	  s32	  Pulse_EgTmp[20];	  //高频脉冲{P,Q,Ps},{Pa,Qa,Psa},{Pb,Qb,Psb},{Pc,Qc,Psc}{Fp,Fq}{Fpa,Fqa}{Fpb,Fqb}{Fpc,Fqc}
	  u32	  Pulse_Eg[20];  //低频脉冲数
	  //---需量脉冲---
	  s32	  Pulse_NeedTmp[12];  
	  u16	  Pulse_Need[12]; //{PNeed,QNeed,PsNeed},{PNeeda,QNeeda,PsNeeda},{PNeedb,QNeedb,PsNeedb},{PNeedc,QNeedc,PsNeedc}48
	  
	  u16	  Angle[9];
	  u16	  PDirect;	 //4
	  u32	  ChkSum1;	 //4
	  u32	  ChkSum2;	 //4
	  
	  u16	  Temperature;	  //温度4
	  u32	  ClockBat; 	  //时钟电池4
	  u32	  BackupBat;	  //后备电池4
	  
	  u16	CF1DelayStamp;
	  u16	CF2DelayStamp;
	  
	  u16	CfIn_P;
	  u16	CfIn_q;
	  
	  u16	CfTime_P;
	  u16	CfTime_q;
	  
  } sDl645FrontTmp_TypeDef;
  
  typedef struct
  {   
	  struct sFrontPubData_TypeDef	{
		  u16	  U[3]; 		  //---电压---NNN.N6
		  u16	  VectorU[9];	  // 正序电压 0--2	负序电压 3---5	零序电压 6---8
		  u32	  I[4]; 		  //---电流NNNN.NNNN(电流值要求3整3小，整定值要求2整4小，最高位表示方向)---16		  
		  u32	  VectorI[9];	  // 正序电流 0--2	负序电流 3---5	零序电流 6---8
		  sDF09   Pw[12];		  //---瞬时有功/无功/视在功率NN.NNNN---{P Pa Pb Pc Q Qa Qb Qc S Sa Sb Sc}36
		  u16	  Pf[4];		  //---功率因数N.NNN---   最高位表示方向{Pf Pfa Pfb Pfc}   8  sDF05
		  u16	  Angle[9]; 	  //---相角NNN.N---	  18
								  //PhUb,PhUc, 以A相电压为基准，B、C相角度				  //(hyg) BCD码
								  //PhIa,PhIb,PhIc,A相电流与A相电压间角度、B相电流与B相电压间角度、C相电流与C相电压间角度
								  //Angle A,Angle B,Angle C, A相电流与A相电压间角度、B相电流与A相电压间角度、C相电流与A相电压间角度
								  //Angle C-Angle A 
		  u32	  UnblU;		  //电压不平衡度NNNN.NN%4
		  u32	  UnblI;		  //电流不平衡度NNNN.NN%4
		  
		  u16	  FuzzyU[3];	  //---电压波形失真度NN.NN%--- 6   
		  u16	  FuzzyI[3];	  //---电流波形失真度NN.NN%--- 6   
		  u16	  WaveU[3][21];   //---相电压谐波含量NN.NN%--- 126 
		  u16	  WaveI[3][21];   //---相电流谐波含量NN.NN%---	 126
		  //---其他---
		  u16	  Frequency;	  //NN.NN 2
		  u32	  PPwave;		  //NN.NNNN 4
		  
		  u16	  Temperature;	  //NNN.N 2
		  u16	  ClockBat; 	  //NN.NN 2
		  u16	  BackupBat;	  //NN.NN 2
		  u8	  PDirect;		  //原功率方向，用于需量处理(0总/1A/2B/3C , 注意与FrontTmp不同) 1
	  } PubData;
	  
	  struct sFrontPriData_TypeDef	{	  
		  u8	  Flag; 		  //---工作异常标志---1
		  u8	  PhaseCalStep;
		  u16	  FrontStamp;
  //	  u8	  BatCalStep;
		  u16	  BatStamp;
  //	  u16	  BatDetStamp;
	  } PriData;  
	  
	  struct sFrontPriPara_TypeDef	{	  
		  u32  PConstE; 		  //有功常数
		  u32  QConstE; 		  //无功常数(Hex码)4
		  u16  Crc;//2
	  } PriPara;	  
  } sDl645Front_TypeDef;  //缓冲区转换后的有效数据
  
  typedef struct 
  { 	  
	  u8 FractionI;/*电流小数位数*/
	  u8 FractionU;/*电压小数位数*/
	  u8 FractionE;/*电能小数位数*/
	  u8 FractionP;/*功率需量小数位数*/
	  u16 ConstE;/*电表有功常数*/
	  u16 Pulse_deltaE;/*数*/
	  u8  HighPulseRate;
	  u8 PhaseCalStep;
	  u32 IRmsConst;		  //10
	  u16 Reserve[2];
	  u16 NOLOAD;
	  u16 ZEROSTAR; 				  //20
	  u32 ChkSum1;
	  u16 HFConst1;
	  u16 HFConst2;
	  u32 VRmsConst;		  //30
	  u16 Reserve1;
	  u32 PRmsConst;
	  u16 Reserve2;
	  u16 VGain[3]; 			  // 42
	  u16 IGain[4]; 			  //48
	  u8  PHSU[2];				  // 56
	  u32 PHSI[3];
	  u16 PRth[4];				  //70
	  u16 UI_Offset[7];
	  u16 P_PHS[3];/*有功相位校正寄存器*/				  // 92
	  u16 PGain[3];/*有功增益校正寄存器*/				  
  }sDl645FirmParaFile_TypeDef;
  
  typedef struct {
#pragma pack(1)
	  struct sDl645EgPubData_TypeDef
	  {
		  sFsEgSh_TypeDef AllPEgSh[DL645_MAX_FL + 1];	  
		  sFsEgSh_TypeDef PtPEgSh[DL645_MAX_FL + 1];	  
		  sFsEgSh_TypeDef NtPEgSh[DL645_MAX_FL + 1];	  
		  
		  sFsEgSh_TypeDef AllQEgSh[DL645_MAX_FL + 1];	  
		  sFsEgSh_TypeDef PtQEgSh[DL645_MAX_FL + 1];	  
		  sFsEgSh_TypeDef NtQEgSh[DL645_MAX_FL + 1];	  
		  
		  sFsEgSh_TypeDef Qd1QEgSh[DL645_MAX_FL + 1];	  
		  sFsEgSh_TypeDef Qd2QEgSh[DL645_MAX_FL + 1];	  
		  sFsEgSh_TypeDef Qd3QEgSh[DL645_MAX_FL + 1];	  
		  sFsEgSh_TypeDef Qd4QEgSh[DL645_MAX_FL + 1];	  
		  
		  sFsEgSh_TypeDef PtPsEgSh[DL645_MAX_FL + 1];	  
		  sFsEgSh_TypeDef NtPsEgSh[DL645_MAX_FL + 1];	  
		  
		  sFsEgSh_TypeDef AssEgSh;						  
		  sFsEgSh_TypeDef BasePtPEgSh;					  
		  sFsEgSh_TypeDef BaseNtPEgSh;					  
